In [1]:
import pandas as pd

## 서울시 CCTV 현황 분석 데이터 읽기

In [2]:
CCTV_Seoul = pd.read_excel("../data/01.Seoul_CCTV.xlsx")
CCTV_Seoul.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,NaN,"(단위 : 대, '23.12.31.일 기준)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,순번,구분,총 계,2015년 이전\n설치된 CCTV,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년,2023년
2,NaN,NaN,계,99515,8759,5725,8537,10770,10619,12855,11525,9358,9379,11988
3,NaN,1,종로구,2031,549,158,128,143,142,67,237,82,225,300
4,NaN,2,중 구,2718,275,236,239,372,386,155,364,419,137,135

In [3]:
CCTV_Seoul = pd.read_excel("../data/01.Seoul_CCTV.xlsx", header = 2, usecols="C:N")
CCTV_Seoul.head()

,구분,총 계,2015년 이전\n설치된 CCTV,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년,2023년
0,계,99515,8759,5725,8537,10770,10619,12855,11525,9358,9379,11988
1,종로구,2031,549,158,128,143,142,67,237,82,225,300
2,중 구,2718,275,236,239,372,386,155,364,419,137,135
3,용산구,3258,88,38,295,491,147,335,473,486,500,405
4,성동구,4409,190,352,278,939,457,640,483,366,233,471

In [4]:
CCTV_Seoul.columns

Index(['구분', '총 계', '2015년 이전\n설치된 CCTV', '2015년', '2016년', '2017년', '2018년',
       '2019년', '2020년', '2021년', '2022년', '2023년'],
      dtype='object')

In [5]:
CCTV_Seoul.rename(columns = {CCTV_Seoul.columns[0]: "구별"}, inplace=True)
CCTV_Seoul.rename(columns = {CCTV_Seoul.columns[2]: "2015년도 이전"}, inplace=True)
CCTV_Seoul.head()

,구별,총 계,2015년도 이전,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년,2023년
0,계,99515,8759,5725,8537,10770,10619,12855,11525,9358,9379,11988
1,종로구,2031,549,158,128,143,142,67,237,82,225,300
2,중 구,2718,275,236,239,372,386,155,364,419,137,135
3,용산구,3258,88,38,295,491,147,335,473,486,500,405
4,성동구,4409,190,352,278,939,457,640,483,366,233,471

In [6]:
CCTV_Seoul.tail()

,구별,총 계,2015년도 이전,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년,2023년
21,관악구,5772,774,447,607,675,663,889,404,549,135,629
22,서초구,5395,227,552,514,1022,422,339,419,565,878,457
23,강남구,7721,672,814,1280,981,735,787,913,505,588,446
24,송파구,4031,223,183,126,227,526,1050,237,151,431,877
25,강동구,3549,571,154,202,273,377,356,614,262,381,359

In [7]:
pop_Seoul = pd.read_excel("../data/01.Seoul_Population.xlsx")
pop_Seoul.head()

/usr/local/Caskroom/miniconda/base/envs/ds_study/lib/python3.8/site-packages/openpyxl/styles/stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

,동별(1),동별(2),2024 1/4,2024 1/4.1,2024 1/4.2,2024 1/4.3,2024 1/4.4,2024 1/4.5,2024 1/4.6,2024 1/4.7,2024 1/4.8,2024 1/4.9,2024 1/4.10,2024 1/4.11
0,동별(1),동별(2),세대 (세대),계 (명),계 (명),계 (명),한국인 (명),한국인 (명),한국인 (명),등록외국인 (명),등록외국인 (명),등록외국인 (명),세대당인구 (명),65세이상고령자 (명)
1,동별(1),동별(2),소계,소계,남자,여자,소계,남자,여자,소계,남자,여자,소계,소계
2,합계,소계,4485819,9635445,4644729,4990716,9384739,4536128,4848611,250706,108601,142105,2.09,1768948
3,합계,종로구,72404,150550,71861,78689,139498,67228,72270,11052,4633,6419,1.93,29127
4,합계,중구,65132,131812,63506,68306,121602,58767,62835,10210,4739,5471,1.87,26302

In [8]:
pop_Seoul = pd.read_excel("../data/01.Seoul_Population.xlsx", header = 1, usecols="B, D, G, J, N")
pop_Seoul.head()

/usr/local/Caskroom/miniconda/base/envs/ds_study/lib/python3.8/site-packages/openpyxl/styles/stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

   동별(2)    계 (명)  한국인 (명) 등록외국인 (명) 65세이상고령자 (명)
0  동별(2)       소계       소계        소계           소계
1     소계  9635445  9384739    250706      1768948
2    종로구   150550   139498     11052        29127
3     중구   131812   121602     10210        26302
4    용산구   223433   209849     13584        39671

In [9]:
pop_Seoul.rename(
    columns = {
        pop_Seoul.columns[0]: "구별",
        pop_Seoul.columns[1]: "인구수",
        pop_Seoul.columns[2]: "한국인",
        pop_Seoul.columns[3]: "외국인",
        pop_Seoul.columns[4]: "고령자",
    },
    inplace = True
)
pop_Seoul.head()

      구별      인구수      한국인     외국인      고령자
0  동별(2)       소계       소계      소계       소계
1     소계  9635445  9384739  250706  1768948
2    종로구   150550   139498   11052    29127
3     중구   131812   121602   10210    26302
4    용산구   223433   209849   13584    39671

---

## Pandas 기초

In [10]:
import pandas as pd
import numpy as np

- pandas는 통상 pd
- numpy는 통상 np

### Series
- index 와 value 로 이루어져 있다.
- 한 가지 데이터 타입만 가질 수 있다.

In [11]:
pd.Series([1, 2, 3, 4])

0    1
1    2
2    3
3    4
dtype: int64

In [12]:
pd.Series([1, 2, 3, 4], dtype=np.float64)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [13]:
pd.Series([1, 2, 3, 4], dtype=str)

0    1
1    2
2    3
3    4
dtype: object

In [14]:
pd.Series({"Key": "Value"})

Key    Value
dtype: object

In [15]:
data = pd.Series([1, 2, 3, 4])
data

0    1
1    2
2    3
3    4
dtype: int64

In [16]:
data % 2

0    1
1    0
2    1
3    0
dtype: int64

### 날짜 데이터

In [17]:
dates = pd.date_range("20210101", periods = 6)
dates

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

### DataFrame
- pd.Serires()
    - index, value 로 구성
- pd.DataFrame()
    - index, value, column 으로 구성

In [18]:
# 표준정규분포에서 샘플링한 난수 생성
data = np.random.randn(6, 4)
data

array([[-0.53577657,  0.3066089 , -0.77413113,  1.10533732],
       [-1.21234342,  1.38163812, -0.10370809,  0.78329499],
       [ 1.06226484,  0.62390079, -0.75759637,  0.09870318],
       [-1.11968888, -2.05891728, -0.14598466,  0.71111701],
       [ 0.43224288,  1.0721    , -1.28912643, -0.15372277],
       [ 1.18463666, -1.37563195,  0.10739292,  0.99943837]])

In [19]:
# DataFrame(data, index, columns)
df = pd.DataFrame(data, index = dates, columns = ["A", "B", "C", "D"])
df

                   A         B         C         D
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-06  1.184637 -1.375632  0.107393  0.999438

#### 데이터 프레임 정보 탐색

In [20]:
# df.head(default = 5)
df.head()

                   A         B         C         D
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117
2021-01-05  0.432243  1.072100 -1.289126 -0.153723

In [21]:
df.tail()

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-06  1.184637 -1.375632  0.107393  0.999438

In [22]:
df.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [23]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [24]:
df.values

array([[-0.53577657,  0.3066089 , -0.77413113,  1.10533732],
       [-1.21234342,  1.38163812, -0.10370809,  0.78329499],
       [ 1.06226484,  0.62390079, -0.75759637,  0.09870318],
       [-1.11968888, -2.05891728, -0.14598466,  0.71111701],
       [ 0.43224288,  1.0721    , -1.28912643, -0.15372277],
       [ 1.18463666, -1.37563195,  0.10739292,  0.99943837]])

- df.info(): 데이터 프레임의 기본 정보 확인

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-01-01 to 2021-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

- df.describe() : 데이터 프레임의 기술통계 정보 확인

In [26]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.031444 -0.008384 -0.493859  0.590695
std    1.069879  1.390875  0.532034  0.505913
min   -1.212343 -2.058917 -1.289126 -0.153723
25%   -0.973711 -0.955072 -0.769997  0.251807
50%   -0.051767  0.465255 -0.451791  0.747206
75%    0.904759  0.960050 -0.114277  0.945403
max    1.184637  1.381638  0.107393  1.105337

#### 데이터 정렬
- sort_values()
    - 특정 컬럼을 기준으로 데이터를 정렬

In [27]:
df

                   A         B         C         D
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-06  1.184637 -1.375632  0.107393  0.999438

In [28]:
df.sort_values(by="B", ascending=False, inplace = True)

In [29]:
df

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-06  1.184637 -1.375632  0.107393  0.999438
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117

#### 데이터 선택

In [30]:
df

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-06  1.184637 -1.375632  0.107393  0.999438
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117

In [31]:
# 한 개 컬럼 선택
df["A"]

2021-01-02   -1.212343
2021-01-05    0.432243
2021-01-03    1.062265
2021-01-01   -0.535777
2021-01-06    1.184637
2021-01-04   -1.119689
Name: A, dtype: float64

In [32]:
type(df["A"])

pandas.core.series.Series

In [33]:
df.A # 컬럼명이 문자인 경우는 "" 괄호 제거 가능

2021-01-02   -1.212343
2021-01-05    0.432243
2021-01-03    1.062265
2021-01-01   -0.535777
2021-01-06    1.184637
2021-01-04   -1.119689
Name: A, dtype: float64

In [34]:
# 두 개 이상 컬럼 선택
df[["A", "B"]]

                   A         B
2021-01-02 -1.212343  1.381638
2021-01-05  0.432243  1.072100
2021-01-03  1.062265  0.623901
2021-01-01 -0.535777  0.306609
2021-01-06  1.184637 -1.375632
2021-01-04 -1.119689 -2.058917

#### offset index
- [n:m] : n부터 m-1 까지
- 인덱스나 컬럼의 이름으로 slice 하는 경우는 끝을 포함한다.

In [35]:
df

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-06  1.184637 -1.375632  0.107393  0.999438
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117

In [36]:
df[0:3]

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-03  1.062265  0.623901 -0.757596  0.098703

In [37]:
df["20210101":"20210104"]

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117

- loc : location
    - index 이름으로 특정 행, 열을 선택

In [38]:
df

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-06  1.184637 -1.375632  0.107393  0.999438
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117

In [39]:
df.loc[:, ["A", "B"]]

                   A         B
2021-01-02 -1.212343  1.381638
2021-01-05  0.432243  1.072100
2021-01-03  1.062265  0.623901
2021-01-01 -0.535777  0.306609
2021-01-06  1.184637 -1.375632
2021-01-04 -1.119689 -2.058917

In [40]:
df.loc["20210101":"20210104", ["A", "D"]]

                   A         D
2021-01-02 -1.212343  0.783295
2021-01-03  1.062265  0.098703
2021-01-01 -0.535777  1.105337
2021-01-04 -1.119689  0.711117

In [41]:
df.loc["20210102":"20210104", "A":"D"]

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117

- iloc : integer location
    - 컴퓨터가 인식하는 인덱스 값으로 선택

In [42]:
df

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-06  1.184637 -1.375632  0.107393  0.999438
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117

In [43]:
df.iloc[3]

A   -0.535777
B    0.306609
C   -0.774131
D    1.105337
Name: 2021-01-01 00:00:00, dtype: float64

In [44]:
df.iloc[3, 2]

-0.774131131061092

In [45]:
df.iloc[3:5, 0:2]

                   A         B
2021-01-01 -0.535777  0.306609
2021-01-06  1.184637 -1.375632

In [46]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2021-01-05  0.432243 -1.289126
2021-01-03  1.062265 -0.757596
2021-01-06  1.184637  0.107393

In [47]:
df.iloc[:, 1:3]

                   B         C
2021-01-02  1.381638 -0.103708
2021-01-05  1.072100 -1.289126
2021-01-03  0.623901 -0.757596
2021-01-01  0.306609 -0.774131
2021-01-06 -1.375632  0.107393
2021-01-04 -2.058917 -0.145985

#### condition

In [48]:
df

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-06  1.184637 -1.375632  0.107393  0.999438
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117

In [49]:
# A 컬럼에서 0보다 큰 숫자(양수)만 선택

df["A"] > 0

2021-01-02    False
2021-01-05     True
2021-01-03     True
2021-01-01    False
2021-01-06     True
2021-01-04    False
Name: A, dtype: bool

In [50]:
df[df["A"] > 0]

                   A         B         C         D
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-06  1.184637 -1.375632  0.107393  0.999438

In [51]:
df[df > 0]

                   A         B         C         D
2021-01-02       NaN  1.381638       NaN  0.783295
2021-01-05  0.432243  1.072100       NaN       NaN
2021-01-03  1.062265  0.623901       NaN  0.098703
2021-01-01       NaN  0.306609       NaN  1.105337
2021-01-06  1.184637       NaN  0.107393  0.999438
2021-01-04       NaN       NaN       NaN  0.711117

- NaN : Not a Number

#### 컬럼 추가
- 기존 컬럼이 없으면 추가
- 기존 컬럼이 있으면 수정

In [52]:
df

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-06  1.184637 -1.375632  0.107393  0.999438
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117

In [53]:
df["E"] = ["one", "two", "three", "four", "five", "six"]
df

                   A         B         C         D      E
2021-01-02 -1.212343  1.381638 -0.103708  0.783295    one
2021-01-05  0.432243  1.072100 -1.289126 -0.153723    two
2021-01-03  1.062265  0.623901 -0.757596  0.098703  three
2021-01-01 -0.535777  0.306609 -0.774131  1.105337   four
2021-01-06  1.184637 -1.375632  0.107393  0.999438   five
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117    six

#### isin()
특정 요소가 있는지 확인

In [54]:
df["E"].isin(["two"])

2021-01-02    False
2021-01-05     True
2021-01-03    False
2021-01-01    False
2021-01-06    False
2021-01-04    False
Name: E, dtype: bool

In [55]:
df["E"].isin(["two", "three", "four"])

2021-01-02    False
2021-01-05     True
2021-01-03     True
2021-01-01     True
2021-01-06    False
2021-01-04    False
Name: E, dtype: bool

In [56]:
df[df["E"].isin(["two", "three", "four"])]

                   A         B         C         D      E
2021-01-05  0.432243  1.072100 -1.289126 -0.153723    two
2021-01-03  1.062265  0.623901 -0.757596  0.098703  three
2021-01-01 -0.535777  0.306609 -0.774131  1.105337   four

#### 특정 컬럼 제거
- del
- drop

In [57]:
del df["E"]
df

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-06  1.184637 -1.375632  0.107393  0.999438
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117

In [58]:
df.drop(["D"], axis = 1) # axis=0 가로, axis=1 세로, default axis = 0

                   A         B         C
2021-01-02 -1.212343  1.381638 -0.103708
2021-01-05  0.432243  1.072100 -1.289126
2021-01-03  1.062265  0.623901 -0.757596
2021-01-01 -0.535777  0.306609 -0.774131
2021-01-06  1.184637 -1.375632  0.107393
2021-01-04 -1.119689 -2.058917 -0.145985

In [59]:
df.drop(["20210104"])

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-06  1.184637 -1.375632  0.107393  0.999438

#### apply()

In [60]:
df

                   A         B         C         D
2021-01-02 -1.212343  1.381638 -0.103708  0.783295
2021-01-05  0.432243  1.072100 -1.289126 -0.153723
2021-01-03  1.062265  0.623901 -0.757596  0.098703
2021-01-01 -0.535777  0.306609 -0.774131  1.105337
2021-01-06  1.184637 -1.375632  0.107393  0.999438
2021-01-04 -1.119689 -2.058917 -0.145985  0.711117

In [61]:
df["A"].apply("sum")

-0.18866447911197304

In [62]:
df["A"].apply("mean")

-0.03144407985199551

In [63]:
df["A"].apply("min"), df["A"].apply("max")

(-1.212343417136163, 1.184636662990061)

In [64]:
df[["A", "D"]].apply("sum")

A   -0.188664
D    3.544168
dtype: float64

In [65]:
df["A"].apply(np.sum)

2021-01-02   -1.212343
2021-01-05    0.432243
2021-01-03    1.062265
2021-01-01   -0.535777
2021-01-06    1.184637
2021-01-04   -1.119689
Name: A, dtype: float64

In [66]:
def plusminus(num):
    return "plus" if num > 0  else "minus"

In [67]:
df["A"].apply(plusminus)

2021-01-02    minus
2021-01-05     plus
2021-01-03     plus
2021-01-01    minus
2021-01-06     plus
2021-01-04    minus
Name: A, dtype: object

In [68]:
df["A"].apply(lambda num: "plus" if num > 0  else "minus")

2021-01-02    minus
2021-01-05     plus
2021-01-03     plus
2021-01-01    minus
2021-01-06     plus
2021-01-04    minus
Name: A, dtype: object

---

## CCTV 데이터 훑어보기

In [69]:
CCTV_Seoul.head()

,구별,총 계,2015년도 이전,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년,2023년
0,계,99515,8759,5725,8537,10770,10619,12855,11525,9358,9379,11988
1,종로구,2031,549,158,128,143,142,67,237,82,225,300
2,중 구,2718,275,236,239,372,386,155,364,419,137,135
3,용산구,3258,88,38,295,491,147,335,473,486,500,405
4,성동구,4409,190,352,278,939,457,640,483,366,233,471

In [70]:
CCTV_Seoul.sort_values(by = "총 계").head()

,구별,총 계,2015년도 이전,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년,2023년
1,종로구,2031,549,158,128,143,142,67,237,82,225,300
10,도봉구,2378,3,0,68,80,152,149,156,552,557,661
2,중 구,2718,275,236,239,372,386,155,364,419,137,135
11,노원구,3006,156,466,310,162,208,311,382,213,161,637
20,동작구,3024,534,124,245,270,299,312,433,28,372,407

In [71]:
CCTV_Seoul.sort_values(by = "총 계", ascending = False).head()

,구별,총 계,2015년도 이전,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년,2023년
0,계,99515,8759,5725,8537,10770,10619,12855,11525,9358,9379,11988
23,강남구,7721,672,814,1280,981,735,787,913,505,588,446
21,관악구,5772,774,447,607,675,663,889,404,549,135,629
22,서초구,5395,227,552,514,1022,422,339,419,565,878,457
12,은평구,5027,524,317,493,361,579,979,386,520,481,387

In [72]:
# 기존 컬럼이 없으면 추가, 있으면 수정
CCTV_Seoul["최근증가율"] = (
    (CCTV_Seoul["2023년"] + CCTV_Seoul["2022년"] + CCTV_Seoul["2021년"])
    / (CCTV_Seoul["2015년도 이전"] + CCTV_Seoul["2015년"] + CCTV_Seoul["2016년"] + CCTV_Seoul["2017년"] + CCTV_Seoul["2018년"]
       + CCTV_Seoul["2019년"] + CCTV_Seoul["2020년"]) * 100
)
CCTV_Seoul.sort_values(by = "최근증가율", ascending = False).head()

,구별,총 계,2015년도 이전,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년,2023년,최근증가율
10,도봉구,2378,3,0,68,80,152,149,156,552,557,661,291.118421
3,용산구,3258,88,38,295,491,147,335,473,486,500,405,74.504553
18,금천구,3169,0,92,130,196,539,366,514,207,304,821,72.509526
16,강서구,3546,303,192,167,416,259,457,362,441,596,353,64.471243
15,양천구,4447,4,216,418,566,827,321,352,347,386,1010,64.460059

In [73]:
pop_Seoul.head()

      구별      인구수      한국인     외국인      고령자
0  동별(2)       소계       소계      소계       소계
1     소계  9635445  9384739  250706  1768948
2    종로구   150550   139498   11052    29127
3     중구   131812   121602   10210    26302
4    용산구   223433   209849   13584    39671

## 인구현황 데이터 훑어보기

In [74]:
pop_Seoul.drop([0, 1], inplace=True) # default 로 axis = 0

In [75]:
pop_Seoul.head()

    구별     인구수     한국인    외국인    고령자
2  종로구  150550  139498  11052  29127
3   중구  131812  121602  10210  26302
4  용산구  223433  209849  13584  39671
5  성동구  284258  276964   7294  50098
6  광진구  350925  335105  15820  57768

In [76]:
pop_Seoul["구별"].unique()

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구'], dtype=object)

In [77]:
len(pop_Seoul["구별"].unique())

25

In [78]:
pop_Seoul["외국인비율"] = pop_Seoul["외국인"] / pop_Seoul["인구수"] * 100
pop_Seoul["고령자비율"] = pop_Seoul["고령자"] / pop_Seoul["인구수"] * 100
pop_Seoul.head()

    구별     인구수     한국인    외국인    고령자     외국인비율      고령자비율
2  종로구  150550  139498  11052  29127  7.341083  19.347061
3   중구  131812  121602  10210  26302   7.74588  19.954177
4  용산구  223433  209849  13584  39671  6.079675  17.755211
5  성동구  284258  276964   7294  50098  2.565979   17.62413
6  광진구  350925  335105  15820  57768  4.508086  16.461637

In [79]:
pop_Seoul.sort_values(by = "인구수", ascending = False).head()

     구별     인구수     한국인    외국인     고령자     외국인비율      고령자비율
25  송파구  659661  653736   5925  110520  0.898189   16.75406
17  강서구  567159  561386   5773  103825   1.01788  18.306154
24  강남구  559720  554280   5440   88662  0.971915   15.84042
12  노원구  501727  497064   4663   97596   0.92939  19.452013
22  관악구  497827  481958  15869   86455  3.187654  17.366475

In [80]:
pop_Seoul.sort_values(by = "외국인", ascending = False).head()

      구별     인구수     한국인    외국인    고령자     외국인비율      고령자비율
18   구로구  414271  391387  22884  81360   5.52392  19.639318
20  영등포구  397942  375148  22794  68650   5.72797  17.251258
7   동대문구  360211  341987  18224  67880  5.059257  18.844511
22   관악구  497827  481958  15869  86455  3.187654  17.366475
6    광진구  350925  335105  15820  57768  4.508086  16.461637

In [81]:
pop_Seoul.sort_values(by = "고령자", ascending = False).head()

     구별     인구수     한국인   외국인     고령자     외국인비율      고령자비율
25  송파구  659661  653736  5925  110520  0.898189   16.75406
17  강서구  567159  561386  5773  103825   1.01788  18.306154
12  노원구  501727  497064  4663   97596   0.92939  19.452013
13  은평구  470185  466007  4178   95209  0.888586  20.249264
24  강남구  559720  554280  5440   88662  0.971915   15.84042

In [82]:
pop_Seoul.sort_values(by = "고령자비율", ascending = False).head()

     구별     인구수     한국인    외국인    고령자     외국인비율      고령자비율
10  강북구  291372  286400   4972  69366   1.70641   23.80668
11  도봉구  308864  306346   2518  71572  0.815246  23.172659
8   중랑구  387433  381966   5467  80250  1.411083  20.713259
13  은평구  470185  466007   4178  95209  0.888586  20.249264
3    중구  131812  121602  10210  26302   7.74588  19.954177

## 두 데이터 합치기

---

#### Pandas 에서 데이터 프레임을 병합하는 방법
- pd.concat()
- pd.merge()
- pd.join()

In [87]:
# 딕셔너리 안의 리스트 형태

left = pd.DataFrame(
    {
        "key": ["K0", "K4", "K2", "K3"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"]
    }
)

left

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [90]:
# 리스트 안의 딕셔너리 형태

right = pd.DataFrame([
    {"key":"K0", "C":"C0", "D":"D0"},
    {"key":"K1", "C":"C1", "D":"D1"},
    {"key":"K2", "C":"C2", "D":"D2"},
    {"key":"K3", "C":"C3", "D":"D3"}
])

right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

#### pd.merge()
- 두 데이터 프레임에서 컬럼이나 인덱스를 기준으로 잡고 병합하는 방법
- 기준이 되는 컬럼이나 인덱스를 키값이라고 한다.
- 기준이 되는 키값은 두 데이터 프레임에 모두 포함되어 있어야 한다.

In [91]:
pd.merge(left, right, on = "key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [92]:
pd.merge(left, right, how = "left", on = "key") # how 인자의 default 값은 "inner" (교집합)

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [93]:
pd.merge(left, right, how = "right", on = "key")

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1  NaN  NaN  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3

In [94]:
pd.merge(left, right, how = "outer", on = "key") # how 인자의 default 값은 "inner" (교집합)

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

---